// Задача 42  Напишите программу которая будет преобразовывать 
// десятичное число в двоичное
// Например
// 45 -> 101101
// 3 -> 11
// 2 -> 10
// 13 -> 1101

Console.WriteLine("Введите число: ");
int sideA = Convert.ToInt32(Console.ReadLine());
